## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-28T18:28:31.903+0000" -> "2023-04-28T18:28:41.978+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ses_active_receipt_rule_set.active will be created
+   resource "aws_ses_active_receipt_rule_set" "active" {
+       arn           = (known after apply)
+       id            = (known after apply)
+       rule_set_name = "grants_ingest-staging-ffis_ingest"
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.aws_s3_bucket_notification.default will be updated in-place
  ~ resource "aws_s3_bucket_notification" "default" {
        id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = "/ffis/raw.eml" -> "/grants.gov/extract.xml"
            id                  = "tf-s3-lambda-20230428182841935700000003"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload" -> "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB"
            # (2 unchanged attributes hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-28T18:28:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:21/invocations" -> (known after apply)
      ~ s3_key                         = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip"
      ~ s3_object_version              = "Xdc2TCSNUT4ashVw_Rq__.IXtRlDcD1J" -> (known after apply)
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:4ff17ef816fd91390f88e5022b767518006b3639,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44" -> "4ff17ef816fd91390f88e5022b767518006b3639"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "21" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "212c3977e7087f1bd27eff3949409c3e-2" -> (known after apply)
      ~ id                     = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> (known after apply)
      ~ key                    = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip"
-       tags                   = {} -> null
      ~ version_id             = "Xdc2TCSNUT4ashVw_Rq__.IXtRlDcD1J" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3693408636551086946" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip"
          ~ "timestamp" = "1682706346968484000" -> "1682707276224305000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6621301817747330284" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/e4ec90e531a5bfbda9dded6585e0b96b8e907270dbe5ee67013c566f6828ba81.zip" -> "builds/875bf0614985f201535cc4a006d38270bdd3d1919e1e4951af9338cd83a9a00d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-28T18:28:41.978+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip"
      ~ s3_object_version              = "fHvfRz_JZbb4SOVHzdBC8t7de0p_5aUY" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:4ff17ef816fd91390f88e5022b767518006b3639,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44" -> "4ff17ef816fd91390f88e5022b767518006b3639"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e53221f90d6d4ae008006f243b4599b4-2" -> (known after apply)
      ~ id                     = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> (known after apply)
      ~ key                    = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip"
-       tags                   = {} -> null
      ~ version_id             = "fHvfRz_JZbb4SOVHzdBC8t7de0p_5aUY" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6905472878196115465" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip"
          ~ "timestamp" = "1682706396752390000" -> "1682707289835175000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6776640084702674433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/814609225ccf7fba781e2890046fb14197403c79bf935cd571c9ea581301bf24.zip" -> "builds/33864eccae14c8c021cc57d727746072e99b935f2640d4f8072223ae362ee643.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-28T18:28:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:20/invocations" -> (known after apply)
      ~ s3_key                         = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip"
      ~ s3_object_version              = "euM7y0NQatWgiVGeFu_mF0i8Kk5F3OP4" -> (known after apply)
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:4ff17ef816fd91390f88e5022b767518006b3639,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "cbe55ed0b82d0bacce9f7f56669eb3975e3b7c44" -> "4ff17ef816fd91390f88e5022b767518006b3639"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "20" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fc97db5370db00a66e56057b2409aa19-2" -> (known after apply)
      ~ id                     = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> (known after apply)
      ~ key                    = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip"
-       tags                   = {} -> null
      ~ version_id             = "euM7y0NQatWgiVGeFu_mF0i8Kk5F3OP4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7804969770880321310" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip"
          ~ "timestamp" = "1682706346991647000" -> "1682707276211298000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7230108630908392739" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/19a9ae8f433e734253d814acf2df7ecbd56b9844add845c9f391ce045d519921.zip" -> "builds/a4a2bc254f30ffe18ce7f91b62e5e1971dc15b50efe2d4422e77aba4ece229b6.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 16 to add, 8 to change, 12 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4833750856)*